Repository: Sebobo/Shel.Neos.TransferContent
Catalog: Resources/Private/Translations/*/ContentTransfer.xlf
Languages: de

# label
source: Transfer content
de: Inhalte transferieren

# description
source: Allows copying pages and their content between multiple sites.
de: Erlaubt das Kopieren von Seiten und deren Inhalt zwischen mehreren Seiten.

# copyNode
source: Transfer document nodes
de: Dokumentknoten kopieren

source: Source site
de: Quellseite

# sourceNodePath
source: Identifier of document node that should be copied
de: Identifikator des Dokumentknotens der kopiert werden soll

source: Target site
de: Zielseite

# targetParentNodePath
source: Identifier of document node, the copied node will be appended to as child
de: Identifikator des Dokumentknotens, an den der kopierte Knoten angehängt werden soll

# moveNodesInstead
source: Should the node be moved entirely instead?
de: Soll der Knoten stattdessen vollständig verschoben werden?

# submit
source: Proceed
de: Fortführen

# help.headline
source: Move vs Copy
de: Verschieben vs. Kopieren

# help.text
source: If the "Move node entirely" option is active, the entire node will be moved to the target location. As a result, links remain.<br />Copying, on the other hand, creates an independent duplicate at the target.
de: Wenn die Option "Knoten vollständig verschieben" aktiv ist, wird die gesamte Node zum Zielort verschoben. Hierdurch bleiben verlinkungen bestehen.<br />Beim kopieren hingegen wird ein eigenständiges Duplikat am Ziel erstellt.

# error.sourceNodeNotFound
source: Source node not found
de: Quelle nicht gefunden

# error.targetParentNodeNotFound
source: Target node not found
de: Ziel nicht gefunden

# error.invalidSourceNode
source: The source node is not of type "Document", but of type "{0}"
de: Der Quellknoten ist nicht vom Typ "Document", aber vom Typ "{0}"

# error.invalidTargetParentNode
source: The target node is not of type "Document", but of type "{0}"
de: Der Zielknoten ist nicht vom Typ "Document", aber vom Typ "{0}"

# error.sourceNodeNotAllowedAsChildNode
source: The type of the copied node is not allowed as child of the target node
de: Der Typ des kopierten Knotens ist nicht als Kind vom Zielknoten erlaubt

# error.copyFailed
source: An error occurred while copying. Reference code "{0}"
de: Beim Kopieren ist ein Fehler aufgetreten. Referenz "{0}"

# message.copied
source: The node was copied
de: Der Knoten wurde kopiert

# message.moved
source: The node was moved
de: Der Knoten wurde verschoben
